src/Catalogs/Имущество/Имущество.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Имущество</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Активность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборСвойств</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/AccountingRegisters/ЖурналОпераций/ЖурналОпераций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>ЖурналОпераций</name>
  <chartOfAccounts>ChartOfAccounts.РазделыУчета</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазделВалютнойОперации</name>
    <type>
      <types>ChartOfAccountsRef.РазделыУчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектВалютнойОперации</name>
    <type>
      <types>Characteristic.ВидыСубконто</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВалютнойОперации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаВалютнойОперации</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
</mdclass:AccountingRegister>

src/InformationRegisters/СтатистикаСправочников/СтатистикаСправочников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатистикаСправочников</name>
  <comment>Вспомогательная информация для использования в отборах</comment>
  <resources>
    <name>КоличествоНеактуальных</name>
    <comment>(Инф.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоАктуальных</name>
    <comment>(Инф.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоПомеченных</name>
    <comment>(Инф.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоВалют</name>
    <comment>(Инф.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоСвободных</name>
    <comment>(Инф.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоДляНакоплений</name>
    <comment>(Инф.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоКредиток</name>
    <comment>(Инф.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоБезналичных</name>
    <comment>(Инф.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоНаличных</name>
    <comment>(Инф.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоВзатыхДолгов</name>
    <comment>(Инф.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоВыданныхДолгов</name>
    <comment>(Инф.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <dimensions>
    <name>Ссылка</name>
    <type>
      <types>CatalogRef.Контакты</types>
      <types>CatalogRef.СтатьиРасходов</types>
      <types>CatalogRef.КошелькиИСчета</types>
      <types>CatalogRef.СтатьиДоходов</types>
      <types>CatalogRef.Имущество</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/Имущество/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьСтоимостьИмущества(Имущество, ДатаОстатка) Экспорт

	Результат = Новый Структура("Валюта, Сумма", Неопределено, 0);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаОстатка",    ДатаОстатка);
	Запрос.УстановитьПараметр("Имущество",      Имущество);
	
	СписокВидовСбк = Новый СписокЗначений;
	СписокВидовСбк.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Имущество);
	Запрос.УстановитьПараметр("СписокВидовСбк",      СписокВидовСбк);
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	БУ.Субконто1 КАК Имущество,
	|	БУ.Валюта,
	|	БУ.ВалютнаяСуммаОстатокДт КАК Сумма
	|ИЗ
	|	РегистрБухгалтерии.ЖурналОпераций.Остатки(&ДатаОстатка, СЧЕТ = ЗНАЧЕНИЕ(ПланСчетов.РазделыУчета.Имущество), &СписокВидовСбк, Субконто1 В (&Имущество)) КАК БУ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли; 
	
	Возврат Результат;

КонецФункции

// Обновляет информационные реквизиты по указанному или всему имуществу
//	в регистре сведений "СтатистикаСправочников".
//Перед использованием необходимо актуализировать ключи статей.
//
//Параметры:
//	Ссылка - СправочникСсылка или Неопределено 
//
Процедура ОбновитьРегистрСтатистики(Ссылка = Неопределено) Экспорт
	
	РегистрыСведений.СтатистикаСправочников.ОбновитьСтатистикуСправочника("Имущество", Ссылка);
	
КонецПроцедуры


#КонецОбласти



#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	// Проверяем/устанавливаем стандартные параметры отбора
	ОбслуживаниеСправочников.ПроверитьСтандартныеПараметрыОтбора(Параметры);
	
	// Если в параметрах есть необходимые ключи/значения будет выполнена расширенная обработка получения данных
	ОбслуживаниеСправочников.ВыполнитьРасширенноеПолучениеДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаОбъекта" Тогда
		
		Если НЕ Параметры.Свойство("Ключ") ИЛИ НЕ ЗначениеЗаполнено(Параметры.Ключ) Тогда
			СтандартнаяОбработка = Ложь;
			ВыбраннаяФорма = "Обработка.ПомощникСозданияИмущества.Форма";
		КонецЕсли;
		
	ИначеЕсли ВидФормы = "ФормаВыбора" ИЛИ ВидФормы = "ФормаВыбораГруппы" Тогда 
		
		ОбслуживаниеСправочников.ОбработкаПолученияФормыВыбора(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#КонецЕсли
